{
  "categories": {
    "introduction": {
      "name": "Introduction",
      "questions": [
        {
          "id": "intro_1",
          "text": "Tell me about yourself and your background.",
          "difficulty": "easy",
          "followUp": "What aspects of your background are most relevant to this position?"
        },
        {
          "id": "intro_2",
          "text": "Walk me through your resume.",
          "difficulty": "easy",
          "followUp": "Which of your past experiences do you think best prepares you for this role?"
        }
      ]
    },
    "behavioral": {
      "name": "Behavioral Questions",
      "questions": [
        {
          "id": "beh_1",
          "text": "Tell me about a challenging situation you faced at work and how you handled it.",
          "difficulty": "medium",
          "followUp": "What would you do differently if you faced a similar situation again?"
        },
        {
          "id": "beh_2",
          "text": "Describe a time when you had to work with a difficult team member.",
          "difficulty": "medium",
          "followUp": "How did this experience change your approach to teamwork?"
        }
      ]
    },
    "technical": {
      "name": "Technical Skills",
      "questions": [
        {
          "id": "tech_1",
          "text": "What programming languages are you most comfortable with and why?",
          "difficulty": "medium",
          "followUp": "Can you give an example of a project where you used these languages effectively?"
        },
        {
          "id": "tech_2",
          "text": "How do you stay updated with the latest technology trends?",
          "difficulty": "easy",
          "followUp": "What recent technology advancement excites you the most?"
        }
      ]
    },
    "problemSolving": {
      "name": "Problem Solving",
      "questions": [
        {
          "id": "prob_1",
          "text": "Describe a complex problem you solved. What was your approach?",
          "difficulty": "hard",
          "followUp": "What tools or methodologies did you use to solve this problem?"
        },
        {
          "id": "prob_2",
          "text": "How do you handle tight deadlines and competing priorities?",
          "difficulty": "medium",
          "followUp": "Can you give a specific example of when you had to manage multiple deadlines?"
        }
      ]
    },
    "closing": {
      "name": "Closing Questions",
      "questions": [
        {
          "id": "close_1",
          "text": "Do you have any questions for me?",
          "difficulty": "easy",
          "followUp": "Is there anything specific about the role or company you'd like to know more about?"
        },
        {
          "id": "close_2",
          "text": "Where do you see yourself in five years?",
          "difficulty": "medium",
          "followUp": "How does this position align with your career goals?"
        }
      ]
    }
  }
}
